import React, { useState, useEffect } from "react";
import axios from "axios";

const Songpage = () => {
  const [term, setTerm] = useState([]);

  useEffect(() => {
    const search = async () => {
      const { data } = await axios.get("http://3.122.232.246:5000/api/poems");
      console.log(data);

      setTerm(
        data.map((song) => {
          return (
            <>
              {song.poemName}
            </>
          );
        })
      );
    };

    search();
  }, []);

  return (
    <>
      <h3>  מה נפש ליבך דואג וחוזר / סלים אנחורי</h3>
      <div className="song_text">
        מה דעתך צופה?<br />
ודמעותיו זרמו<br />
הוא הולך משוחרר על הלחי<br />
הלהבה שלו מועדת<br />
כפנינה זו ברית של שבר<br />
הבוקר של נוברוז מפוזר<br />
או החוזה שירשתי<br />
החוטים שלו נתקעו<br />
עם להבת הלחי שהיא מתהדרת<br />
כמו גן עדן, שמטהר<br />
ושיער ענבר מפתה<br />
יש בו בננה חילול קודש<br />
זה נשבר על ידי מגע<br />
מושק מבושם<br />
היקום ממלא פרסום<br />
בו מתפרסמים הראשונים<br />
הברית שלי עם הפרתך מוגבהת<br />
השמיים התגבשו<br />
הוא נערם בשייקים אוטומטיים<br />
אוכל וכל זה תמציות<br />
בין גחלים ליין<br />
פלאים משפיעים עליה<br />
במרכז הלהבה אתה יכול לראות את זה<br />
זה דוהה, לא מוטרד<br />
זה זה בו הודפס למעט<br />
יהלומים לא יתנפצו<br />
זה נמשך על גדותיו באור<br />
מודרך, מסופר ושתוי<br />
איזה סוד הפך לסוד<br />
במוח של התלהמות הוא מרומז<br />
הוא לא היה נועל דלת<br />
בו האור מוסתר<br />
בכעס הוא הבחין במנעול<br />
על ידי זה אל-דארארי נכבש<br />
אתה עצוב ונעלם<br />
אש ולא התאדה<br />
כיצד ניתן לתפוס כוכב?<br />
ואיך לנעול את קוותאר<br />
ללב אין חסרונות<br />
כמו גלים ורוח החורקים<br />
מעלה ומטה בין<br />
לבלוע מוסתר וגלוי<br />
והחזה מגלה סערה<br />
כמו עגילים באוזן שורש<br />
זה לא מסתדר<br />
בחשכת השירה בקול רם<br />
עם היותך שכן שחוט<br />
עבור כופר בלילה הוא נשחט<br />
שרשרת עטופה בפרח<br />
עם שחר תהיה הופעה<br />
אומר עמוד אור<br />
בשיא השלב, אור<br />
זה הפך להיות במדבר סינה<br />
משפחת יקוב היא בן שיחה<br />
והיא שכנה במבנה חסן<br />
להדרכה, פלטפורמה<br />
לעטוף סביב גילו, אבל<br />
מראות מסנוורים ומסנוורים<br />
לא הייתי רואה את הכעס שלי<br />
אתה כובש הנאה עם Askar<br />
אתה מגיע לשלווה עם מלחמה<br />
בו האבות המומים<br />
אתה כמהה לבני אדם<br />
זה מחזיר אוסף שבור<br />
לבבות מבוזבזים<br />
באוויר מוחזק מעידה<br />
העפעף זורק חצים<br />
העין נקטעת<br />
והשוליים מותחים קשת<br />
וקוהל מצייר פגיון<br />
אז איך כל הצבאות של<br />
כסאות לא נסוגים<br />
יבשה, ים ואלקה<br />
ירחים אינם מבולבלים<br />
זכות למעשר רכוש<br />
בנחיתה של ההתגלות זה מופיע<br />
לזכותו של כל נביא<br />
אלוהים צם וגדל<br />
זכותם של אלף אפוטרופוסים<br />
על ידי תחייה ואלמוות הזהיר<br />
על זכותו של כל אסיר<br />
במקדש הכפרה של ירושלים<br />
על ידי כתר היופי הנכון<br />
איתו גדלת כמו קיסר<br />
מימין לתנוחת חנית<br />
אני נותן לך את אנטאר היום<br />
גדלתי כצבי<br />
אז איך הופכים לווסלים?<br />
תן את התשובה ואת התשובה<br />
הלב הזה נשבר<br />
הו חי'רי מתוק, היית מייחל<br />
לחיות אחריך זה נורא<br />
הלב שלך הפך לאחר<br />
נפרד מדף מרמר<br />

     
      <div>{term}</div>
    </div></>
  );
};

export default Songpage;
